print ("Здравствуйте, мои конфетки, —\n Папы, мамы и их детки,\n Дедушки и бабушки,\n Умницы и лапушки,\n Дяденьки и тети,\n Как вы все живете?\n Поди, соскучились за мной —\n Дедом Морозом с бородой?!\n Буду вас я поздравлять —\nНастроения желать\n Хорошего, стабильного,\n Ужина обильного,\n Шуток, юмора и смеха,\n Ну, а возраст — не помеха.\n Пусть улыбкаво весь рот\n Украшает целый год!")

print ("Напиши письмо Деду Морозу")
print ("Как тебя зовут?")
a = input()
print ("Сколько тебе лет?")
b = input()
print ("Как ты вёл себя в этом году?")
c = input()
print ("Какой подарок хочешь получить?")
d = input()
print ("Тебя зовут" , a , "Тебе" ,  b , " Ты вёл себя в этом году" , c , "Хочешь получить" , d )

print ("Дед Мороз желает вам, дорогие мои, исполнения заветных желаний и огромной радости в жизни, невероятных чудес и необыкновенного волшебства, верных целей и стремления к ним, больших успехов и великих побед, доброго здоровья и веселых праздников для души.")
